daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
/*************************************************************************************************
 *          Macronix xSPI-NOR Flash BSP driver extension for STM32 QUADSPI IP
 * @file    stm32xxx_QUADSPI_MXIC_ex.c
 * @brief   This file contains command flow of the Flash specific command.
 * @Author  Peter Chang / Macronix; peterchang01@mxic.com.tw
 *************************************************************************************************
 * History :
 * 2023/12/20 Release V2.0.0
 *            Rename stm32f769i_discovery_qspi_MXIC_ex.h to stm32xxx_qspi_MXIC_ex.h
 *            Rename stm32f769i_discovery_qspi_MXIC_ex.c to stm32xxx_qspi_MXIC_ex.c
 *            Remove USE_AUTO_DC_CONFIGURATION define
 *            Alignment BSP input parameter between QUAD-SPI & OCTO-SPI IP
 *            Move BSP_QSPI_ReadConfigurationRegister2() & BSP_QSPI_WriteConfigurationRegister2()
 *            form stm32xxx_qspi_MXIC_ex.c to stm32xxx_qspi_MXIC.c
 * 2023/01/30 Release V1.2.0
 * 2022/12/21 Add BSP_QSPI_WritePacket() & BSP_QSPI_ReadPacket() commands
 * 2022/12/12 Release V1.1.0
 * 2022/12/08 Rename to stm32xxx_QUADSPI_MXIC_ex.c from stm32f769i_discovery_qspi_MXIC_ex.c
 * 2022/10/06 Move RPMC functions to stm32f769i_discovery_qspi_MXIC_ex.c
 * 2022/06/15 Release V1.0.0
 * 2022/05/04 Initial version.
 *************************************************************************************************/
/* Includes -------------------------------------------------------------------------------------*/
#include "stm32xxx_qspi_MXIC.h"
#include "stm32xxx_qspi_MXIC_ex.h"

#ifdef SUPPORT_RPMC
#include <string.h>
#include "hmac_sha2.h"
#endif


extern QSPI_HandleTypeDef QSPIHandle[];
extern QSPI_Ctx_t         QSPICtx[];

/* Private variables ---------------------------------------------------------*/
/* Private subroutine---------------------------------------------------------*/

/*******************************************************************************
 * Export Functions
 ******************************************************************************/
/* Secured OTP Memory Array Operations */
#ifdef MXIC_SNOR_ENTER_SECURED_OTP_CMD
/**
  * @brief  Enter Secured OTP mode
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_EnterSecuredOTP(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_EnterSecuredOTP(&QSPIHandle[Instance], QSPICtx[Instance].InterfaceMode) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_ENTER_SECURED_OTP_CMD

#ifdef MXIC_SNOR_EXIT_SECURED_OTP_CMD
/**
  * @brief  Exit Secured OTP mode
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ExitSecuredOTP(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_ExitSecuredOTP(&QSPIHandle[Instance], QSPICtx[Instance].InterfaceMode) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_EXIT_SECURED_OTP_CMD

#ifdef MXIC_SNOR_WRITE_SECURITY_REGISTER_CMD
/**
  * @brief  Write Security Register. To set the "Lock-Down" bit as 1.
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_WriteSecurityRegister(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Issue Write Security Register command */
    else if(MXIC_SNOR_WriteSecurityRegister(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for end of write */
    else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_WRITE_SECURITY_REGISTER_CMD

#ifdef MXIC_SNOR_ENTER_4K_BIT_MODE_CMD
/**
  * @brief  Enter 4K bit Mode (Additional memory)
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_Enter4KbitMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_Enter4KbitMode(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_ENTER_4K_BIT_MODE_CMD

#ifdef MXIC_SNOR_EXIT_4K_BIT_MODE_CMD
/**
  * @brief  Exit 4K bit Mode (Additional memory)
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_Exit4KbitMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_Exit4KbitMode(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_EXIT_4K_BIT_MODE_CMD

#ifdef MXIC_SNOR_ENTER_PARALLEL_MODE_CMD
/**
  * @brief  Enter Parallel Mode, Flash accept 1-1-8 command
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_EnterParallelMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_EnterParallelMode(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_ENTER_PARALLEL_MODE_CMD

#ifdef MXIC_SNOR_EXIT_PARALLEL_MODE_CMD
/**
  * @brief  Exit Parallel Mode
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ExitParallelMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

