daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_ExitParallelMode(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_EXIT_PARALLEL_MODE_CMD

#ifdef MXIC_SNOR_ENTER_SECURITY_FIELD_CMD
/**
  * @brief  Enter Security Field
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_EnterSecurityField(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_EnterSecurityField(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_ENTER_SECURITY_FIELD_CMD

#ifdef MXIC_SNOR_EXIT_SECURITY_FIELD_CMD
/**
  * @brief  Enter Security Field
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ExitSecurityField(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_ExitSecurityField(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_EXIT_SECURITY_FIELD_CMD

#ifdef SUPPORT_SECURITY_FIELD_COMMAND
/**
  * @brief  Reset Packet buffer address pointer
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
static int32_t QSPI_PacketBufferAddressReset(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      CommandHandle.Address = MXIC_SNOR_PACKET_BUFFER_ADDRESS_RESET;
      CommandHandle.Size    = 0;
      if(MXIC_SNOR_WritePacket(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Write a Packet Command to Security Flash
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_WritePacket(uint32_t Instance, uint8_t *pData, uint32_t Size)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if(QSPI_PacketBufferAddressReset(Instance) != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      MXIC_SNOR_CommandHandle_t CommandHandle;

      CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

      /* Enable write operations */
      if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else
      {
        CommandHandle.Address = MXIC_SNOR_PACKET_BUFFER_ADDRESS;
        CommandHandle.Size    = Size;
        CommandHandle.pBuffer = pData;
        if(MXIC_SNOR_WritePacket(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        } /* Configure automatic polling mode to wait for end of process */
        else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
      }
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Read response data from Security Flash
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadPacket(uint32_t Instance, uint8_t *pData, uint32_t Size)
{
  int32_t ret = BSP_ERROR_NONE;


  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if(QSPI_PacketBufferAddressReset(Instance) != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      MXIC_SNOR_CommandHandle_t CommandHandle;

      CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
      //CommandHandle.Address = MXIC_SNOR_PACKET_BUFFER_ADDRESS;
      CommandHandle.Size    = Size;
      CommandHandle.pBuffer = pData;
      if(MXIC_SNOR_ReadPacket(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // SUPPORT_SECURITY_FIELD_COMMAND

#ifdef MXIC_SNOR_READ_SFDP_CMD
/**
  * @brief  Reads an amount of SFDP data from the QSPI memory.
  * @param  pData:   Buffer pointer
  *         Address: Read start address
  *         Size:    Size of data to read in Byte
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadSFDP(uint32_t Instance, uint8_t *pData, uint32_t Address, uint32_t Size)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Address = Address;
    CommandHandle.Size    = Size;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_ReadSFDP(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_SFDP_CMD

/* SPB/DPB/Permanent Lock Operations; Advanced Sector Protection */
#ifdef MXIC_SNOR_WRITE_PROTECT_SELECTION_CMD
/**
  * @brief  Enter and enable individual block protect mode
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_EnableIndividualBlockProtectMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

