daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;
    MXIC_SNOR_SecurityRegister_t SCUReg;

    /* Read WPSEL flag, check if Flash in individual block protect mode already */
    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = (uint8_t *)&SCUReg;
    if(MXIC_SNOR_ReadSecurityRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if(SCUReg.WPSEL == 0)
    {
      if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else if(MXIC_SNOR_WriteProtectSelection(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      } /* Configure automatic polling mode to wait for end of program */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      } /* Check WPSEL flag, Read again  */
      else
      {
        CommandHandle.pBuffer = (uint8_t *)&SCUReg;
        if(MXIC_SNOR_ReadSecurityRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        } /* If set WPSEL flag success ? */
        else if(SCUReg.WPSEL == 0)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_WRITE_PROTECT_SELECTION_CMD

#ifdef MXIC_SNOR_GANG_BLOCK_LOCK_CMD
/**
  * @brief  Gang block lock. Whole chip write protect.
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_GangBlockLock(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    } /* Issue Gang Block Lock command */
    else if(MXIC_SNOR_GangBlockLock(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    } /* Configure automatic polling mode to wait for end of program */
    else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_GANG_BLOCK_LOCK_CMD

#ifdef MXIC_SNOR_GANG_BLOCK_UNLOCK_CMD
/**
  * @brief  Gang block unlock. Whole chip unprotect.
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_GangBlockUnlock(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    } /* Issue Gang Block Lock command */
    else if(MXIC_SNOR_GangBlockUnlock(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    } /* Configure automatic polling mode to wait for end of program */
    else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_GANG_BLOCK_UNLOCK_CMD

#ifdef MXIC_SNOR_SINGLE_BLOCK_LOCK_CMD
/**
  * @brief  Single Block Lock
  * @param  Instance  QSPI instance
  *         Address : Block address
  * @retval BSP status
  */
int32_t BSP_QSPI_SingleBlockLock(uint32_t Instance, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;
    MXIC_SNOR_SecurityRegister_t SCUReg;

    /* Read WPSEL flag, check if Flash in individual block protect mode already */
    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = (uint8_t *)&SCUReg;
    if(MXIC_SNOR_ReadSecurityRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Check if device in individual block protect mode */
    else if(SCUReg.WPSEL == 0)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else
      {
        CommandHandle.Address = Address;
        if(MXIC_SNOR_SingleBlockLock(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        } /* Configure automatic polling mode to wait for end of program */
        else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
          CommandHandle.Address = Address;
          CommandHandle.pBuffer = CommandHandle.Parameter.Type8;
          if(MXIC_SNOR_ReadBlockLockStatus(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
          else if(CommandHandle.Parameter.Type8[0] != MXIC_SNOR_BLOCK_LOCKED)
          {
            ret = BSP_ERROR_LOCK_FAILURE;
          }
        }
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_SINGLE_BLOCK_LOCK_CMD

#ifdef MXIC_SNOR_SINGLE_BLOCK_UNLOCK_CMD
/**
  * @brief  Single Block Un-Lock
  * @param  Instance  QSPI instance
  *         Address : Block address
  * @retval BSP status
  */
int32_t BSP_QSPI_SingleBlockUnLock(uint32_t Instance, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

