daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;
    MXIC_SNOR_SecurityRegister_t SCUReg;

    /* Read WPSEL flag, check if Flash in individual block protect mode already */
    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = (uint8_t *)&SCUReg;
    if(MXIC_SNOR_ReadSecurityRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Check if device in individual block protect mode */
    else if(SCUReg.WPSEL == 0)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else
      {
        CommandHandle.Address = Address;
        if(MXIC_SNOR_SingleBlockUnLock(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
        {
          return BSP_ERROR_COMPONENT_FAILURE;
        } /* Configure automatic polling mode to wait for end of program */
        else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
        {
          return BSP_ERROR_COMPONENT_FAILURE;
        }

#if defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_CMD) || defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_8DC_CMD)
        /* Check permanent lock status*/
        CommandHandle.Address = Address;
        CommandHandle.pBuffer = CommandHandle.Parameter.Type8;
        if(MXIC_SNOR_ReadBlockPermanentLockStatus(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
        {
          return BSP_ERROR_COMPONENT_FAILURE;
        }
        else if(CommandHandle.Parameter.Type8[0] == MXIC_SNOR_BLOCK_LOCKED)
        {
          return BSP_ERROR_UNLOCK_FAILURE;
        }
#endif  // defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_CMD) || defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_8DC_CMD)

        /* Check block lock status*/
        CommandHandle.Address = Address;
        CommandHandle.pBuffer = CommandHandle.Parameter.Type8;
        if(MXIC_SNOR_ReadBlockLockStatus(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else if(CommandHandle.Parameter.Type8[0] == MXIC_SNOR_BLOCK_LOCKED)
        {
          ret = BSP_ERROR_UNLOCK_FAILURE;
        }
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_SINGLE_BLOCK_UNLOCK_CMD

#ifdef MXIC_SNOR_READ_BLOCK_LOCK_STATUS_CMD
/**
  * @brief  Read Block Lock Status
  * @param  Instance  QSPI instance
  *         Address : Block address
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadBlockLockStatus(uint32_t Instance, MXIC_SNOR_BlockLockTypeDef *pData, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Address = Address;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_ReadBlockLockStatus(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_BLOCK_LOCK_STATUS_CMD

#ifdef MXIC_SNOR_READ_DPB_REGISTER_CMD
/**
  * @brief  Read DPB register, 1 Byte. SPI only
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadDPBRegister(uint32_t Instance, MXIC_SNOR_DPBRegisterTypeDef *pData, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    /* Issue Read DPB Register command */
    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Address = Address;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_ReadDPBRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_DPB_REGISTER_CMD

#ifdef MXIC_SNOR_WRITE_DPB_REGISTER_CMD
/**
  * @brief  Write DPB register. SPI only
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_WriteDPBRegister(uint32_t Instance, MXIC_SNOR_DPBRegisterTypeDef Data, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    /* Enable write operations */
    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else /* Issue Write DPB Register command */
    {
      CommandHandle.Address = Address;
      CommandHandle.pBuffer = &Data;
      if(MXIC_SNOR_WriteDPBRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }/* Configure automatic polling mode to wait for command end */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_WRITE_DPB_REGISTER_CMD

#ifdef MXIC_SNOR_READ_SPB_STATUS_CMD
/**
  * @brief  Read SPB status. SPI only
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadSPBStatus(uint32_t Instance, MXIC_SNOR_SPBRegisterTypeDef *pData, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

