daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    /* Issue Read SPB Status Register command */
    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Address = Address;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_ReadSPBStatus(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_SPB_STATUS_CMD

#ifdef MXIC_SNOR_WRITE_SPB_CMD
/**
  * @brief  Write SPB. SPB bit program. SPI only
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_WriteSPB(uint32_t Instance, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Issue Write SPB command */
      CommandHandle.Address = Address;
      if(MXIC_SNOR_WriteSPB(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }/* Configure automatic polling mode to wait for command end */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_WRITE_SPB_CMD

#ifdef MXIC_SNOR_ERASE_SPB_CMD
/**
  * @brief  Erase SPB (ESSPB), All SPB bit erase. SPI only
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_EraseSPB(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if(MXIC_SNOR_EraseSPB(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for command end */
    else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_ERASE_SPB_CMD

/* Lock Register Operations */
#ifdef MXIC_SNOR_READ_LOCK_REGISTER_CMD
/**
  * @brief  Read Lock Register value. 1/2 Byte
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadLockRegister(uint32_t Instance, MXIC_SNOR_LockRegister_t *pData)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }/* Issue Read Lock Register command */
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = (uint8_t *)pData;
    if(MXIC_SNOR_ReadLockRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_LOCK_REGISTER_CMD

#ifdef MXIC_SNOR_WRITE_LOCK_REGISTER_CMD
/**
  * @brief  Write lock register. 1/2 Byte
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_WriteLockRegister(uint32_t Instance, MXIC_SNOR_LockRegister_t Data)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      CommandHandle.pBuffer = (uint8_t *)&Data;
      if(MXIC_SNOR_WriteLockRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }/* Configure automatic polling mode to wait for command end */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_WRITE_LOCK_REGISTER_CMD

#ifdef MXIC_SNOR_SPB_LOCK_SET_CMD
/**
  * @brief  SPB lock set. SPI only
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_SPBLockSet(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Issue SPB Lock Set command */
    else if(MXIC_SNOR_SPBLockSet(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for command end */
    else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_SPB_LOCK_SET_CMD

#ifdef MXIC_SNOR_READ_SPB_LOCK_REGISTER_CMD
/**
  * @brief  Read SPB lock register value. SPI only
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadSPBLockRegister(uint32_t Instance, MXIC_SNOR_SPBLockRegister_t *pData)
{
  int32_t ret = BSP_ERROR_NONE;

