daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = (uint8_t *)pData;
    if(MXIC_SNOR_ReadSPBLockRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_SPB_LOCK_REGISTER_CMD

#ifdef MXIC_SNOR_WRITE_READ_LOCK_CONFIGURATION_CMD
/**
  * @brief  Write Read-Lock Area Configuration Register
  * @param  Instance  QSPI instance
  *         Data      MXIC_SNOR_ReadLockRegister_t data
  * @retval BSP status
  */
int32_t BSP_QSPI_WriteReadLockAreaConfigurationRegister(uint32_t Instance, MXIC_SNOR_ReadLockRegister_t Data)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else /* Issue Write DPB Register command */
    {
      CommandHandle.pBuffer = (uint8_t *)&Data;
      if(MXIC_SNOR_WriteReadLockAreaConfigurationRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }/* Configure automatic polling mode to wait for command end */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_WRITE_READ_LOCK_CONFIGURATION_CMD

#ifdef MXIC_SNOR_READ_READ_LOCK_CONFIGURATION_CMD
/**
  * @brief  Read Read-Lock Area Configuration Register
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadReadLockAreaConfigurationRegister(uint32_t Instance, MXIC_SNOR_ReadLockRegister_t *pData)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = (uint8_t *)pData;
    if(MXIC_SNOR_ReadReadLockAreaConfigurationRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_READ_LOCK_CONFIGURATION_CMD

#ifdef MXIC_SNOR_PERMANENT_LOCK_BIT_LOCK_DOWN_CMD
/**
  * @brief  Permanent Lock bit Lock Down
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_PermanentLockbitLockDown(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if(MXIC_SNOR_PermanentLockbitLockDown(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for command end */
    else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_PERMANENT_LOCK_BIT_LOCK_DOWN_CMD

#ifdef MXIC_SNOR_READ_PERMANENT_LOCK_BIT_LOCK_DOWN_CMD
/**
  * @brief  Read Permanent Lock bit Lock Down
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadPermanentLockbitLockDown(uint32_t Instance, MXIC_SNOR_PermanentLockDownRegister_t *pData)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = (uint8_t *)pData;
    if(MXIC_SNOR_ReadPermanentLockbitLockDown(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_PERMANENT_LOCK_BIT_LOCK_DOWN_CMD

#ifdef MXIC_SNOR_WRITE_READ_LOCK_BIT_CMD
/**
  * @brief  Write Read-Lock Bit; Setting read-lock on the specified 128K Byte area.
  * @param  Instance  QSPI instance
  *         Data      Change bit 2 (RLB) of Security Register only.
  * @retval BSP status
  */
int32_t BSP_QSPI_WriteReadLockBit(uint32_t Instance, MXIC_SNOR_SecurityRegister_t Data)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else /* Issue Write DPB Register command */
    {
      CommandHandle.pBuffer = (uint8_t *)&Data;
      if(MXIC_SNOR_WriteReadLockBit(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }/* Configure automatic polling mode to wait for command end */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_WRITE_READ_LOCK_BIT_CMD

#ifdef MXIC_SNOR_BLOCK_WRITE_LOCK_PROTECTION_CMD
/**
  * @brief  Block Write Lock Protection; Write protection a specified block (64K)
  * @param  Instance  QSPI instance
  *         Address   Protected 64K block address
  * @retval BSP status
  */
int32_t BSP_QSPI_BlockWriteLockProtection(uint32_t Instance, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

