daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    /* Enable write operations */
    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else /* Issue Write DPB Register command */
    {
      CommandHandle.Address = Address;
      if(MXIC_SNOR_BlockWriteLockProtection(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }/* Configure automatic polling mode to wait for command end */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_BLOCK_WRITE_LOCK_PROTECTION_CMD

#ifdef MXIC_SNOR_PERMANENT_LOCK_CMD
/**
  * @brief  Permanent Lock; Permanent Lock a specified block (64K, Read only forever)
  * @param  Instance  QSPI instance
  *         Address   Protected 64K block address
  * @retval BSP status
  */
int32_t BSP_QSPI_PermanentLock(uint32_t Instance, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else /* Issue Write DPB Register command */
    {
      CommandHandle.Address = Address;
      if(MXIC_SNOR_PermanentLock(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }/* Configure automatic polling mode to wait for command end */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }

#if defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_CMD) || defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_8DC_CMD)
      else
      {
        /* Check permanent lock status*/
        CommandHandle.Address = Address;
        CommandHandle.pBuffer = CommandHandle.Parameter.Type8;
        if(MXIC_SNOR_ReadBlockPermanentLockStatus(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else if(CommandHandle.Parameter.Type8[0] != MXIC_SNOR_BLOCK_LOCKED)
        {
          ret = BSP_ERROR_LOCK_FAILURE;
        }
      }
#endif  // defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_CMD) || defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_8DC_CMD)
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_PERMANENT_LOCK_CMD

#ifdef MXIC_SNOR_READ_BLOCK_WRITE_LOCK_STATUS_CMD
/**
  * @brief  Read Block Write Lock status; Read the status of a specified block (64K)
  * @param  Instance  QSPI instance
  *         Address   Block address
  *         pData     Buffer pointer
  * @retval BSP status
  *         *pData = Lock status; DQ0 = 1 = Locked
  */
int32_t BSP_QSPI_ReadBlockWriteLockStatus(uint32_t Instance, uint8_t *pData, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Address = Address;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_ReadBlockWriteLockStatus(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_BLOCK_WRITE_LOCK_STATUS_CMD

#if defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_CMD) || defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_8DC_CMD)
/**
  * @brief  Read Block Permanent Lock Status; Read the status of Permanent Lock of a specified block (64K)
  * @param  Instance  QSPI instance
  *         Address   Block address
  *         pData     Buffer pointer
  * @retval BSP status
  *         *pData = Lock status; DQ0 = 1 = Locked
  */
int32_t BSP_QSPI_ReadBlockPermanentLockStatus(uint32_t Instance, MXIC_SNOR_BlockLockTypeDef *pData, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Address = Address;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_ReadBlockPermanentLockStatus(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_CMD) || defined(MXIC_SNOR_READ_PERMANENT_LOCK_STATUS_8DC_CMD)

#ifdef MXIC_SNOR_CHIP_UNPROCECT_CMD
/**
  * @brief  Chip unprotect; Disable the lock protection block of the whole chip
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ChipUnprotect(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if(MXIC_SNOR_ChipUnprotect(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for command end */
    else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_CHIP_UNPROCECT_CMD

#ifdef MXIC_SNOR_BP4_KEY1_CMD
/**
  * @brief  Key command to set BP4
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_SetBP4Key1(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

