daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_BP4Key1(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_BP4_KEY1_CMD

#ifdef MXIC_SNOR_BP4_KEY2_CMD
/**
  * @brief  Key command to set BP4
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_SetBP4Key2(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_BP4Key2(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_BP4_KEY2_CMD

#ifdef MXIC_SNOR_READ_PASSWORD_REGISTER_CMD
/**
  * @brief  Read password register value. 8 Byte, SPI only
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadPasswordRegister(uint32_t Instance, uint8_t *pData)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    /* Issue Read Password Register command */
    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_ReadPasswordRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_PASSWORD_REGISTER_CMD

#ifdef MXIC_SNOR_WRITE_PASSWORD_REGISTER_CMD
/**
  * @brief  Write password register. Always write 8 byte data, SPI only
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_WritePasswordRegister(uint32_t Instance, uint8_t *pData)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      CommandHandle.pBuffer = pData;
      if(MXIC_SNOR_WritePasswordRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }/* Configure automatic polling mode to wait for command end */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_WRITE_PASSWORD_REGISTER_CMD

#ifdef MXIC_SNOR_PASSWORD_UNLOCK_CMD
/**
  * @brief  Password unlock. Always write 8 byte data, SPI only
  * @param  Instance  QSPI instance
  *         Password  8 Byte password pointer for compare to Password register
  * @retval BSP status
  */
int32_t BSP_QSPI_PasswordUnlock(uint32_t Instance, uint8_t *pData)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      CommandHandle.pBuffer = pData;
      if(MXIC_SNOR_PasswordUnlock(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }/* Configure automatic polling mode to wait for command end */
      else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_PASSWORD_UNLOCK_CMD

#ifdef MXIC_SNOR_READ_SECURITY_REGISTER_CMD
/**
  * @brief  Read security register value
  * @param  Instance  QSPI instance
  * @param  Security  Content of QSPI security register
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadSecurityRegister(uint32_t Instance, MXIC_SNOR_SecurityRegister_t *pData)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = (uint8_t *)pData;
    if(MXIC_SNOR_ReadSecurityRegister(&QSPIHandle[Instance],  &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_SECURITY_REGISTER_CMD

#ifdef MXIC_SNOR_CLEAR_SECURITY_REGISTER_FAIL_FLAG_CMD
/**
  * @brief  Clear Security Register bit 6 & bit 5
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ClearSecurityRegisterFailFlags(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_ClearSecurityRegisterFailFlags(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_CLEAR_SECURITY_REGISTER_FAIL_FLAG_CMD

#ifdef MXIC_SNOR_READ_FAST_BOOT_REGISTER_CMD
/**
  * @brief  Read Fast Boot Register
  * @param  Instance  QSPI instance
  * @param  Security  Content of QSPI security register
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadFastBootRegister(uint32_t Instance, MXIC_SNOR_FastBootRegister_t *pData)
{
  int32_t ret = BSP_ERROR_NONE;

