daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if(MXIC_SNOR_FactoryModeEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
#ifdef MXIC_SNOR_READ_FACTORY_MODE_STATUS_REGISTER_CMD
    else
    {
      CommandHandle.pBuffer = CommandHandle.Parameter.Type8;
      if(MXIC_SNOR_ReadFactoryModeStatusRegister(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else if(CommandHandle.Parameter.Type8[0] != 0xFF)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
#endif  // MXIC_SNOR_READ_FACTORY_MODE_STATUS_REGISTER_CMD
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_FACTORY_MODE_ENABLE_CMD

#ifdef MXIC_SNOR_SET_BURST_LENGTH_CMD
/**
  * @brief  Set burst length
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_SetBurstLength(uint32_t Instance, MXIC_SNOR_WrapAroundTypeDef Data)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = &Data;
    if(MXIC_SNOR_SetBurstLength(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_SET_BURST_LENGTH_CMD

#ifdef MXIC_SNOR_READ_ELECTRONIC_ID_CMD
/**
  * @brief  Read Electronic Signature (1 Byte)
  * @param  Instance  QSPI instance
  *         pData     Buffer pointer
  * @retval BSP status
  *         *pData = Signature (1 Byte)
  */
int32_t BSP_QSPI_ReadElectronicSignature(uint32_t Instance, uint8_t *pData)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_ReadElectronicSignature(&QSPIHandle[Instance],  &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_ELECTRONIC_ID_CMD

#if defined(MXIC_SNOR_READ_ELECTRONIC_MANFACTURER_ID_CMD)  || defined(MXIC_SNOR_READ_ELECTRONIC_MANFACTURER_ID_CMD2) || \
    defined(MXIC_SNOR_READ_ELECTRONIC_MANFACTURER_ID_CMD4) || defined(MXIC_SNOR_READ_ELECTRONIC_MANFACTURER_ID_CMD4D)
/**
  * @brief  Read Electronic Manufacturer ID & Device ID (2 Byte)
  * @param  Instance  QSPI instance
  *         pData     Buffer pointer
  *         Address
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadElectronicManufacturerDeviceID(uint32_t Instance, uint8_t *pData, uint32_t Address)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Address = Address;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_ReadElectronicManufacturerDeviceID(&QSPIHandle[Instance],  &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // defined(MXIC_SNOR_READ_ELECTRONIC_MANFACTURER_ID_CMD) ...

#ifdef SUPPORT_WRITE_BUFFER_ACCESS
/**
  * @brief  Interruptible Write to Buffer (Max. 256 Byte)
  * @param  Instance QSPI instance
  *         pData    Buffer pointer
  *         Address  Write address
  *         Size     Data size in Byte
  * @retval BSP status
  */
int32_t BSP_QSPI_InterruptibleWrite(uint32_t Instance, uint8_t *pData, uint32_t Address, uint32_t Size)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

    /* Enable write operations */
    if(MXIC_SNOR_WriteEnable(&QSPIHandle[Instance], CommandHandle.Mode) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      CommandHandle.Address = Address;
      CommandHandle.Size    = Size;
      CommandHandle.pBuffer = pData;
      if(MXIC_SNOR_WriteBufferInitial(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else if(MXIC_SNOR_WriteBufferConfirm(&QSPIHandle[Instance], QSPICtx[Instance].InterfaceMode) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Read data from page buffer (Write Buffer Read)
  * @param  Instance QSPI instance
  *         pData    Buffer pointer
  *         Address  Write address
  *         Size     Data size in Byte
  * @retval BSP status
  */
int32_t BSP_QSPI_PageBufferRead(uint32_t Instance, uint8_t *pData, uint32_t Address, uint32_t Size)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Address = Address;
    CommandHandle.Size    = Size;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_WriteBufferRead(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Write Buffer Continue
  * @param  Instance QSPI instance
  *         pData    Buffer pointer
  *         Address  Write address
  *         Size     Data size in Byte
  * @retval BSP status
  */
int32_t BSP_QSPI_PageBufferContinueWrite(uint32_t Instance, uint8_t *pData, uint32_t Address, uint32_t Size)
{
  int32_t ret = BSP_ERROR_NONE;

