daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Address = Address;
    CommandHandle.Size    = Size;
    CommandHandle.pBuffer = pData;
    if(MXIC_SNOR_WriteBufferContinue(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Write Buffer Confirm
  * @param  Instance QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_PageBufferConfirm(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_WriteBufferConfirm(&QSPIHandle[Instance], QSPICtx[Instance].InterfaceMode) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // SUPPORT_WRITE_BUFFER_ACCESS

#ifdef MXIC_SNOR_ENABLE_SO_OUTPUT_RYBY_CMD
/**
  * @brief  Enable SO to output RY/BY# during CP mode
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_EnableSOOutputRYBY(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_EnableSOOutputRYBY(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_ENABLE_SO_OUTPUT_RYBY_CMD

#ifdef MXIC_SNOR_DISABLE_SO_OUTPUT_RYBY_CMD
/**
  * @brief  Disable SO to output RY/BY# during CP mode
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_DisableSOOutputRYBY(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_DisableSOOutputRYBY(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_DISABLE_SO_OUTPUT_RYBY_CMD

#ifdef MXIC_SNOR_HOLD_ENABLE_CMD
/**
  * @brief  Hold Enable, Enable HOLD# pin function
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_EnableHoldPinFunction(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_HoldEnable(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_HOLD_ENABLE_CMD

#ifdef MXIC_SNOR_IDLE_ERASE_CMD
/**
  * @brief  Idle Erase
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_EnterIdleErase(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_IdleErase(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_IDLE_ERASE_CMD

#ifdef MXIC_SNOR_RELEASE_FROM_IDLE_ERASE_CMD
/**
  * @brief  Release from Idle Erase
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_ReleaseFromIdeleErase(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MXIC_SNOR_ReleaseFromIdeleErase(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Configure automatic polling mode to wait for WIP = 0 */
  else if(MXIC_SNOR_AutoPollingMemReady(&QSPIHandle[Instance], QSPICtx[Instance].InterfaceMode) != MXIC_SNOR_ERROR_NONE)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_RELEASE_FROM_IDLE_ERASE_CMD

#ifdef MXIC_SNOR_READ_IDLE_ERASE_STATUS_CMD
/**
  * @brief  Release from Idle Erase
  * @param  Instance  QSPI instance
  * @retval BSP status
  *         *pData = Idle Erase Status Value
  */
int32_t BSP_QSPI_ReadIdeleEraseStatus(uint32_t Instance, MXIC_SNOR_IdleEraseStatus_t *pData)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.pBuffer = (uint8_t *)pData;
    if(MXIC_SNOR_ReadIdeleEraseStatus(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // MXIC_SNOR_READ_IDLE_ERASE_STATUS_CMD

/*******************************************************************************
 * RPMC Functions
 ******************************************************************************/
#ifdef SUPPORT_RPMC
/**
  * WRITE_ROOT_KEY_REGISTER :
  *      Byte      |   0    |    1    |       2       |    3   |  4-35  |     36-63
  * ---------------+--------+---------+---------------+--------+--------+-------------------
  * Write Root Key |OP1 0x9B|CmdType 0|Counter Address|Reserved|Root Key|Truncated Signature
  *                |Command |                  Data
  * @brief  RPMC　Flash Write Root Key Register
  *         Message[4] = OP1 + CmdType + CounterAddr + Reserved
  * @param  Instance   QSPI Instance
  *         CounterAddress  Counter Address of the root key
  *         pRootKey        Must be 32 Byte root key buffer pointer
  * @retval BSP status
  */
int32_t BSP_QSPI_RPMCWriteRootKeyRegister(uint32_t Instance, uint8_t CounterAddress, uint8_t *pRootKey)
{
  int32_t ret = BSP_ERROR_NONE;
  MXIC_SNOR_CommandHandle_t CommandHandle;
  uint8_t Buffer[64];
  uint8_t *Message            = Buffer;         // 4 Byte = OP1 + CmdType + CounterAddr + Reserved
  uint8_t *Key                = &Buffer[4];     // 32 Byte
  uint8_t *TruncatedSignature = &Buffer[32];    // 32 Byte, Truncate first 4 Byte of Signature

