daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
  CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    Message[0] = MXIC_SNOR_RPMC_OP1_CMD;                  // OP1
    Message[1] = MXIC_SNOR_RPMC_WRITE_ROOT_KEY_REGISTER;  // CmdType
    Message[2] = CounterAddress;                          // CounterAddr
    Message[3] = 0;                                       // Reserved, force to 0
    hmac_sha256(pRootKey, MXIC_SNOR_RPMC_KEY_SIZE, Message, 4, TruncatedSignature, SHA256_DIGEST_SIZE);
    memcpy(Key, pRootKey, MXIC_SNOR_RPMC_KEY_SIZE);       // 32 Byte, Truncate Signature first 4 Byte

    CommandHandle.Size    = sizeof(Buffer) - 1;
    CommandHandle.pBuffer = &Buffer[1];
    if(MXIC_SNOR_RPMCOP1(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if(MXIC_SNOR_RPMCPollingReady(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      // Read Extended Status Register
      CommandHandle.Size    = 1;
      CommandHandle.pBuffer = CommandHandle.Parameter.Type8;
      if(MXIC_SNOR_RPMCOP2(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else if(CommandHandle.Parameter.Type8[0] != MXIC_SNOR_RPMC_ESR_SUCCESSFUL)
      {
        ret = BSP_ERROR_RPMC_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  RPMC　Flash Update HMAC Key Register
  *         Message[8] = OP1 + CmdType + CounterAddr + Reserved + Key Data
  * @param  Instance   QSPI Instance
  *         CounterAddress  Counter Address of the root key
  *         pRootKey        Must be 32 Byte root key buffer pointer
  *         pKeyData        Must be 4 Byte key data buffer pointer
  *         pHMACKey        Must be 32 Byte HMAC Key buffer pointer
  * @retval BSP status
  *         *pHMACKey       Retrieve 32 Byte HMAC Key
  */
int32_t BSP_QSPI_RPMCUpdateHMACKeyRegister(uint32_t Instance, uint8_t CounterAddress, uint8_t *pRootKey, uint8_t *pKeyData, uint8_t *pHMACKey)
{
  int32_t ret = BSP_ERROR_NONE;
  MXIC_SNOR_CommandHandle_t CommandHandle;
  uint8_t Buffer[40];
  uint8_t *Message   = Buffer;         // 8 Byte = OP1 + CmdType + CounterAddr + Reserved + Key Data
  uint8_t *KeyData   = &Buffer[4];     // 4 Byte
  uint8_t *Signature = &Buffer[8];     // 32 Byte

  CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    Message[0] = MXIC_SNOR_RPMC_OP1_CMD;                  // OP1
    Message[1] = MXIC_SNOR_RPMC_UPDATE_HMAC_KEY_REGISTER; // CmdType
    Message[2] = CounterAddress;                          // CounterAddr
    Message[3] = 0;                                       // Reserved, force to 0
    memcpy(KeyData, pKeyData, 4);

    hmac_sha256(pRootKey, MXIC_SNOR_RPMC_KEY_SIZE, KeyData, 4, pHMACKey,  SHA256_DIGEST_SIZE);
    hmac_sha256(pHMACKey, MXIC_SNOR_RPMC_KEY_SIZE, Message, 8, Signature, SHA256_DIGEST_SIZE);

    CommandHandle.Size    = sizeof(Buffer) - 1;
    CommandHandle.pBuffer = &Buffer[1];
    if(MXIC_SNOR_RPMCOP1(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if(MXIC_SNOR_RPMCPollingReady(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      // Read Extended Status Register
      CommandHandle.Size    = 1;
      CommandHandle.pBuffer = CommandHandle.Parameter.Type8;
      if(MXIC_SNOR_RPMCOP2(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else if(CommandHandle.Parameter.Type8[0] != MXIC_SNOR_RPMC_ESR_SUCCESSFUL)
      {
        ret = BSP_ERROR_RPMC_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  RPMC　Flash Increment Monotonic Counter
  *         Message[8] = OP1 + CmdType + CounterAddr + Reserved + Counter Data
  * @param  Instance   QSPI Instance
  *         CounterAddress  Counter Address of the root key
  *         pHMACKey        Must be 32 Byte HMAC key buffer pointer
  *         Counter         32 bit counter value (little endian)
  * @retval BSP status
  */
int32_t BSP_QSPI_RPMCIncrementMonotonicCounter(uint32_t Instance, uint8_t CounterAddress, uint8_t *pHMACKey, uint32_t Counter)
{
  int32_t ret = BSP_ERROR_NONE;
  MXIC_SNOR_CommandHandle_t CommandHandle;
  uint8_t Buffer[40];
  uint8_t *Message     = Buffer;         // 8 Byte = OP1 + CmdType + CounterAddr + Reserved + Counter Data
  uint8_t *CounterData = &Buffer[4];     // 4 Byte
  uint8_t *Signature   = &Buffer[8];     // 32 Byte

  CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    Message[0] = MXIC_SNOR_RPMC_OP1_CMD;                     // OP1
    Message[1] = MXIC_SNOR_RPMC_INCREMENT_MONOTONIC_COUNTER; // CmdType
    Message[2] = CounterAddress;                             // CounterAddr
    Message[3] = 0;                                          // Reserved, force to 0
    // Little endian convert to bit endian
    CounterData[0] = Counter >> 24;
    CounterData[1] = Counter >> 16;
    CounterData[2] = Counter >> 8;
    CounterData[3] = Counter;

    hmac_sha256(pHMACKey, MXIC_SNOR_RPMC_KEY_SIZE, Message, 8, Signature, SHA256_DIGEST_SIZE);

    CommandHandle.Size    = sizeof(Buffer) - 1;
    CommandHandle.pBuffer = &Buffer[1];
    if(MXIC_SNOR_RPMCOP1(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if(MXIC_SNOR_RPMCPollingReady(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      // Read Extended Status Register
      CommandHandle.Size    = 1;
      CommandHandle.pBuffer = CommandHandle.Parameter.Type8;
      if(MXIC_SNOR_RPMCOP2(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else if(CommandHandle.Parameter.Type8[0] != MXIC_SNOR_RPMC_ESR_SUCCESSFUL)
      {
        ret = BSP_ERROR_RPMC_FAILURE;
      }
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  RPMC　Flash Request Monotonic Counter
  *         Message[16] = OP1 + CmdType + CounterAddr + Reserved + Tag
  * @param  Instance   QSPI Instance
  *         CounterAddress  Counter Address of the root key
  *         pHMACKey        Must be 32 Byte HMAC key buffer pointer
  *         pTag            Must be 12 Byte tag buffer pointer
  *         Counter         32 bit counter buffer pointer
  * @retval BSP status
  *         *Counter        Retrieve 32 bit counter value
  */
int32_t BSP_QSPI_RPMCRequestMonotonicCounter(uint32_t Instance, uint8_t CounterAddress, uint8_t *pHMACKey, uint8_t *pTag, uint32_t *Counter)
{
  int32_t ret = BSP_ERROR_NONE;
  MXIC_SNOR_CommandHandle_t CommandHandle;
  uint8_t Buffer[48];
  uint8_t *Message   = Buffer;         // 16 Byte = OP1 + CmdType + CounterAddr + Reserved + Tag
  uint8_t *Tag       = &Buffer[4];     // 12 Byte
  uint8_t *Signature = &Buffer[16];    // 32 Byte

