daniel-0723/STM32CubeMX/Files/Drivers/QSPI Flash driver/stm32xxx_qspi_MXIC_ex.c
  CommandHandle.Mode = QSPICtx[Instance].InterfaceMode;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    Message[0] = MXIC_SNOR_RPMC_OP1_CMD;                     // OP1
    Message[1] = MXIC_SNOR_RPMC_REQUEST_MONOTONIC_COUNTER;   // CmdType
    Message[2] = CounterAddress;                             // CounterAddr
    Message[3] = 0;                                          // Reserved, force to 0
    memcpy(Tag, pTag, 12);

    hmac_sha256(pHMACKey, MXIC_SNOR_RPMC_KEY_SIZE, Message, 16, Signature, SHA256_DIGEST_SIZE);

    CommandHandle.Size    = sizeof(Buffer) - 1;
    CommandHandle.pBuffer = &Buffer[1];
    if(MXIC_SNOR_RPMCOP1(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if(MXIC_SNOR_RPMCPollingReady(&QSPIHandle[Instance]) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      RPMC_OP2ReadData_t OP2ReadData;

      CommandHandle.Size    = sizeof(RPMC_OP2ReadData_t);
      CommandHandle.pBuffer = (uint8_t *)&OP2ReadData;
      if(MXIC_SNOR_RPMCOP2(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else if(OP2ReadData.ESR != MXIC_SNOR_RPMC_ESR_SUCCESSFUL)
      {
        ret = BSP_ERROR_RPMC_FAILURE;
      }
      else
      {
        /* Verify Signature **************************************************/
        hmac_sha256(pHMACKey, MXIC_SNOR_RPMC_KEY_SIZE, &OP2ReadData.Tag[0], 16, Signature, SHA256_DIGEST_SIZE);

        if(memcmp(OP2ReadData.Signature, Signature, SHA256_DIGEST_SIZE) != 0)
        {
          ret = BSP_ERROR_RPMC_FAILURE;
        }
        else
        {
          // Big endian convert to little endian
          *Counter = (OP2ReadData.CRD[0] << 24) |(OP2ReadData.CRD[1] << 16) | (OP2ReadData.CRD[2] << 8) | OP2ReadData.CRD[3];
        }
      }
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  RPMC　Flash Read data
  * @param  Instance   QSPI Instance
  *         pBuffer    Buffer for store read data
  *         Size       Read data size in Byte
  * @retval BSP status
  *         *pBuffer   Retrieve read data
  */
int32_t BSP_QSPI_RPMCReadData(uint32_t Instance, uint8_t *pBuffer, uint8_t Size)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_NOR_INSTANCE_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    MXIC_SNOR_CommandHandle_t CommandHandle;

    CommandHandle.Mode    = QSPICtx[Instance].InterfaceMode;
    CommandHandle.Size    = Size;
    CommandHandle.pBuffer = pBuffer;
    if(MXIC_SNOR_RPMCOP2(&QSPIHandle[Instance], &CommandHandle) != MXIC_SNOR_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif  // SUPPORT_RPMC
/************************ (C) COPYRIGHT Macronix *****END OF FILE****/